# 客户类型字典
CUST_TYPE = {
    "普通客户": "系统内",
    "潜力客户": "系统内",
    "亲密客户": "系统内",
    "TOP客户": "系统内",
    "default": "系统外",
}

# 项目来源字典
PROJECT_SOURCE = {
    "线索转化": "直接立项",
    "预立项转化": "前置立项",
    "default": "直接立项",
}

# 收入合同类型字典
INCOME_CONTRACT_TYPE = {
    "技术": "技术",
    "虚拟合同": "虚拟合同",
    "销售物品": "销售物品",
    "其他": "其他",
    "default": "其他",

}

# 成本合同类型字典
OUT_CONTRACT_TYPE = {
    "技术": "技术",
    "虚拟合同": "虚拟合同",
    "销售物品": "销售物品",
    "其他": "其他",
    "default": "其他",
}

# 支付方式字典
PAY_TYPE = {
    "2:7:1": "2:7:1",
    "3:3:2:1:1": "3:3:2:1:1",
    "3:3:3.5:0.5": "3:3:3.5:0.5",
    "3:3:3:1": "3:3:3:1",
    "3:5:1:1": "3:5:1:1",
    "3:6:1": "3:6:1",
    "3:7": "3:7",
    "default": "3:7",
}

CHECK_LIST = [
    "2018-07-25",
    "2014-05-08",
]

# 结算方式
SETTLE_TYPE = {
    "汇款": "汇款",
    "支票": "支票",
    "其他": "其他",
    "default": "其他",
}

# 项目类型字典
PROJECT_TYPE = {
    "办公经费": "办公经费项目",
    "技术服务": "技术服务项目",
    "软件开发": "软件开发项目",
    "外包类": "外包项目",
    "系统集成": "系统集成项目",
    "运营类": "运营项目",
    # "独立团队": "",  # 请慧慧姐确认
}

# 部门合并对应关系
DEPT_MERGE = {
    "市场部2020": "市场部",
    "项目管理部": "项目部",
    "战略发展部2021": "战略发展部",
    "集成业务组": "集成业务部",
    "亿云信息技术有限公司": "山东亿云信息技术有限公司",
}
