# 客户类型字典
CUST_TYPE = {
    "普通客户": "系统内",
    "潜力客户": "系统内",
    "亲密客户": "系统内",
    "TOP客户": "系统内",
    "default": "系统外",
}

# 项目类型字典
PROJECT_TYPE = {
    "软件开发": "系统内",
    "default": "系统外"
}

# 项目来源字典
PROJECT_SOURCE = {
    "线索转化": "直接立项",
    "预立项转化": "前置立项",
    "default": "直接立项",
}

# 收入合同类型字典
INCOME_CONTRACT_TYPE = {
    "技术": "技术",
    "虚拟合同": "虚拟合同",
    "销售物品": "销售物品",
    "其他": "其他",
    "default": "其他",

}

# 成本合同类型字典
OUT_CONTRACT_TYPE = {
    "技术": "技术",
    "虚拟合同": "虚拟合同",
    "销售物品": "销售物品",
    "其他": "其他",
    "default": "其他",
}

# 支付方式字典
PAY_TYPE = {
    "2:7:1": "2:7:1",
    "3:3:2:1:1": "3:3:2:1:1",
    "3:3:3.5:0.5": "3:3:3.5:0.5",
    "3:3:3:1": "3:3:3:1",
    "3:5:1:1": "3:5:1:1",
    "3:6:1": "3:6:1",
    "3:7": "3:7",
    "default": "3:7",
}

CHECK_LIST = [
    "2018-07-25",
    "2014-05-08",
]
